README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-22 Fri 22:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Norwid Behrnd" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb5c764e">1. context/motivation</a></li>
<li><a href="#org2498bec">2. implementation</a></li>
<li><a href="#orgb236793">3. test case</a></li>
<li><a href="#org11b9ef3">4. the script</a></li>
<li><a href="#org2409980">5. content of the project</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb5c764e" class="outline-2">
<h2 id="orgb5c764e"><span class="section-number-2">1.</span> context/motivation</h2>
<div class="outline-text-2" id="text-1">
<p>
By the post <a href="https://openmolecules.org/forum/index.php?t=msg&amp;th=586&amp;goto=1587&amp;#msg_1587">Assign cluster name based on cluster size</a> (April 7,
2022), user mcmc observes DataWarrior labels the clusters in
sequence of their creation.  mcmc suggests it were beneficial if the
cluster labels would reflect their popularity e.g., the greater the
number of molecules in a cluster, the lower the assigned label.
</p>
</div>
</div>

<div id="outline-container-org2498bec" class="outline-2">
<h2 id="org2498bec"><span class="section-number-2">2.</span> implementation</h2>
<div class="outline-text-2" id="text-2">
<p>
DataWarrior's result of clustering (<code>Chemistry -&gt; cluster
  compounds/reactions</code>) may be exported as text file (<code>File -&gt; Save
  Special</code>).  The originally assigned cluster label (second column)
may be read-out to yield an intermediate dictionary.  Here, the
frequency of DataWarrior's labels may be sort to generate a
permanent record of the molecules with a newly assigned cluster
label.
</p>

<p>
The method is implemented in a script for Python 3.  For better
portability, only functions available from the standard library are
used.
</p>
</div>
</div>

<div id="outline-container-orgb236793" class="outline-2">
<h2 id="orgb236793"><span class="section-number-2">3.</span> test case</h2>
<div class="outline-text-2" id="text-3">
<p>
A library of 100 random drug-like molecules was generated by
DataWarrior and clustered at low threshold of similarity (<code>Structure
  FragFp 0.5</code>, file <code>100Random_Molecules.dwar</code>).  The export (file
<code>100Random_Molecules.txt</code>) was processed by
</p>

<div class="org-src-container">
<pre class="src src-bash">python3 datawarrior_clustersort.py 100Random_Molecules.txt
</pre>
</div>

<p>
to yield <code>100Random_Molecules_sort.txt</code> as newly assigned set.  As
preview, the script briefly describes the distribution prior and
after the sort to the CLI:
</p>
<pre class="example">
Preview, sort by DataWarrior's cluster labels:
cluster:  1 	 molecules:  11
cluster:  2 	 molecules:  28
cluster:  3 	 molecules:  29
cluster:  4 	 molecules:  14
cluster:  5 	 molecules:  8
cluster:  6 	 molecules:  2
cluster:  7 	 molecules:  3
cluster:  8 	 molecules:  2
cluster:  9 	 molecules:  1
cluster:  10 	 molecules:  1
cluster:  11 	 molecules:  1

clusters newly sorted and labeled:
cluster:  1 	 molecules:  29
cluster:  2 	 molecules:  28
cluster:  3 	 molecules:  14
cluster:  4 	 molecules:  11
cluster:  5 	 molecules:  8
cluster:  6 	 molecules:  3
cluster:  7 	 molecules:  2
cluster:  8 	 molecules:  2
cluster:  9 	 molecules:  1
cluster:  10 	 molecules:  1
cluster:  11 	 molecules:  1
</pre>


<p>
By comparison of the text files' entries (Chemistry -&gt; Find Similar
Compounds In File) with <code>Structure Exact</code> as method of scrutiny, all
100 molecules of the input file correspond to exactly on entry in
the new record.  The size of the clusters prior/after the assignment
match each other, the same molecules are grouped together.
</p>
</div>
</div>

<div id="outline-container-org11b9ef3" class="outline-2">
<h2 id="org11b9ef3"><span class="section-number-2">4.</span> the script</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #99968b;">#</span><span style="color: #99968b;">!/usr/bin/env python3</span>

<span style="color: #99968b;"># </span><span style="color: #99968b;">name:    datawarrior_clustersort.py</span>
<span style="color: #99968b;"># </span><span style="color: #99968b;">author:  nbehrnd@yahoo.com</span>
<span style="color: #99968b;"># </span><span style="color: #99968b;">license: GPL v2, 2022.</span>
<span style="color: #99968b;"># </span><span style="color: #99968b;">date:    &lt;2022-04-22 Fri&gt;</span>
<span style="color: #99968b;"># </span><span style="color: #99968b;">edit:</span>
<span style="color: #95e454;">"""Provide a sort on DataWarrior clusters by popularity of the cluster.</span>

<span style="color: #95e454;">For context and motivation, see DataWarrior's discussion board after mcmc's</span>
<span style="color: #95e454;">post 'Assign cluster name based on cluster size' by April 7, 2022</span>
<span style="color: #95e454;">(https://openmolecules.org/forum/index.php?t=msg&amp;th=586&amp;goto=1587&amp;#msg_1587).</span>

<span style="color: #95e454;">The script uses only functions of Python's standard library."""</span>

<span style="color: #8ac6f2; font-weight: bold;">import</span> argparse
<span style="color: #8ac6f2; font-weight: bold;">import</span> csv
<span style="color: #8ac6f2; font-weight: bold;">import</span> os
<span style="color: #8ac6f2; font-weight: bold;">import</span> sys


<span style="color: #8ac6f2; font-weight: bold;">def</span> <span style="color: #cae682;">get_args</span>():
    <span style="color: #95e454;">"""Get the arguments from the command line."""</span>
    <span style="color: #cae682;">parser</span> = argparse.ArgumentParser(
        description=
        <span style="color: #95e454;">"""Sort DataWarrior's cluster list, begin with the most populated.</span>
<span style="color: #95e454;">        For an input file 'example.txt', a new record 'example_sort.txt'</span>
<span style="color: #95e454;">        is written DataWarrior may access directly (Ctrl + O)."""</span>)

    parser.add_argument(<span style="color: #95e454;">"source_file"</span>,
                        metavar=<span style="color: #95e454;">"FILE"</span>,
                        <span style="color: #e5786d;">help</span>=<span style="color: #95e454;">"DataWarrior's cluster export as .txt file."</span>)

    parser.add_argument(
        <span style="color: #95e454;">"-r"</span>,
        <span style="color: #95e454;">"--reverse"</span>,
        action=<span style="color: #95e454;">"store_false"</span>,
        <span style="color: #e5786d;">help</span>=<span style="color: #95e454;">"""Override the default; sort in the permanent record starts</span>
<span style="color: #95e454;">        with the cluster least populated and ends with the cluster containing</span>
<span style="color: #95e454;">        the most molecules."""</span>)

    <span style="color: #8ac6f2; font-weight: bold;">return</span> parser.parse_args()


<span style="color: #8ac6f2; font-weight: bold;">def</span> <span style="color: #cae682;">access_raw_data</span>(input_file=<span style="color: #95e454;">""</span>):
    <span style="color: #95e454;">"""Access DW's exported cluster list."""</span>
    <span style="color: #cae682;">raw_data</span> = []

    <span style="color: #8ac6f2; font-weight: bold;">try</span>:
        <span style="color: #8ac6f2; font-weight: bold;">with</span> <span style="color: #e5786d;">open</span>(input_file, encoding=<span style="color: #95e454;">"utf-8"</span>, mode=<span style="color: #95e454;">"r"</span>) <span style="color: #8ac6f2; font-weight: bold;">as</span> source:
            <span style="color: #cae682;">raw_data</span> = source.readlines()
    <span style="color: #8ac6f2; font-weight: bold;">except</span> <span style="color: #92a65e; font-weight: bold;">OSError</span>:
        <span style="color: #8ac6f2; font-weight: bold;">print</span>(f<span style="color: #95e454;">"Input file {input_file} was not accessible.  Exit."</span>)
        sys.<span style="color: #e5786d;">exit</span>()

    <span style="color: #8ac6f2; font-weight: bold;">return</span> raw_data


<span style="color: #8ac6f2; font-weight: bold;">def</span> <span style="color: #cae682;">read_header</span>(raw_data=[]):
    <span style="color: #95e454;">"""Extract the headline of DW's table."""</span>
    <span style="color: #cae682;">table_header</span> = <span style="color: #95e454;">""</span>
    <span style="color: #cae682;">table_header</span> = <span style="color: #e5786d;">str</span>(raw_data[0]).strip()

    <span style="color: #8ac6f2; font-weight: bold;">return</span> table_header


<span style="color: #8ac6f2; font-weight: bold;">def</span> <span style="color: #cae682;">read_dw_list</span>(raw_data=[]):
    <span style="color: #95e454;">"""Establish a frequency list based on DW's exported cluster list."""</span>
    <span style="color: #cae682;">dw_cluster_labels</span> = []

    <span style="color: #cae682;">source</span> = csv.reader(raw_data, delimiter=<span style="color: #95e454;">"\t"</span>)
    <span style="color: #8ac6f2; font-weight: bold;">for</span> row <span style="color: #8ac6f2; font-weight: bold;">in</span> source:
        <span style="color: #cae682;">cluster_label_on_molecule</span> = row[1]
        dw_cluster_labels.append(cluster_label_on_molecule)
    <span style="color: #8ac6f2; font-weight: bold;">del</span> dw_cluster_labels[0]  <span style="color: #99968b;"># </span><span style="color: #99968b;">do not consider the table header</span>

    <span style="color: #99968b;"># </span><span style="color: #99968b;">build and report a dictionary:</span>
    <span style="color: #cae682;">count</span> = {}
    <span style="color: #8ac6f2; font-weight: bold;">for</span> label <span style="color: #8ac6f2; font-weight: bold;">in</span> dw_cluster_labels:
        count.setdefault(label, 0)
        <span style="color: #cae682;">count</span>[label] = count[label] + 1

    <span style="color: #8ac6f2; font-weight: bold;">for</span> key, value <span style="color: #8ac6f2; font-weight: bold;">in</span> count.items():
        <span style="color: #8ac6f2; font-weight: bold;">print</span>(<span style="color: #95e454;">"cluster: "</span>, key, <span style="color: #95e454;">"\t molecules: "</span>, value)

    <span style="color: #8ac6f2; font-weight: bold;">return</span> count


<span style="color: #8ac6f2; font-weight: bold;">def</span> <span style="color: #cae682;">entry_sorter</span>(count={}, reversed_order=<span style="color: #e5786d;">False</span>):
    <span style="color: #95e454;">"""Sort the popularity of the clusters either way."""</span>
    <span style="color: #8ac6f2; font-weight: bold;">if</span> reversed_order:
        <span style="color: #cae682;">sorted_list</span> = <span style="color: #e5786d;">sorted</span>(count, key=count.__getitem__, reverse=<span style="color: #e5786d;">True</span>)
    <span style="color: #8ac6f2; font-weight: bold;">else</span>:
        <span style="color: #cae682;">sorted_list</span> = <span style="color: #e5786d;">sorted</span>(count, key=count.__getitem__, reverse=<span style="color: #e5786d;">False</span>)
    <span style="color: #8ac6f2; font-weight: bold;">return</span> sorted_list


<span style="color: #8ac6f2; font-weight: bold;">def</span> <span style="color: #cae682;">scrutin_by_label</span>(raw_data=[], population_list=[]):
    <span style="color: #95e454;">"""Sort the molecules according to the cluster popularity."""</span>
    <span style="color: #cae682;">reporter_list</span> = []
    <span style="color: #cae682;">new_cluster_label</span> = 1

    <span style="color: #8ac6f2; font-weight: bold;">for</span> entry <span style="color: #8ac6f2; font-weight: bold;">in</span> population_list:
        <span style="color: #cae682;">source</span> = csv.reader(raw_data, delimiter=<span style="color: #95e454;">"\t"</span>)

        <span style="color: #8ac6f2; font-weight: bold;">for</span> row <span style="color: #8ac6f2; font-weight: bold;">in</span> source:
            <span style="color: #8ac6f2; font-weight: bold;">if</span> row[1] == entry:
                <span style="color: #cae682;">retain</span> = <span style="color: #95e454;">"\t"</span>.join([row[0], <span style="color: #e5786d;">str</span>(new_cluster_label), row[2]])
                reporter_list.append(retain)

        <span style="color: #cae682;">new_cluster_label</span> += 1

    <span style="color: #8ac6f2; font-weight: bold;">return</span> reporter_list


<span style="color: #8ac6f2; font-weight: bold;">def</span> <span style="color: #cae682;">permanent_report</span>(input_file=<span style="color: #95e454;">""</span>, topline=<span style="color: #95e454;">""</span>, listing=[]):
    <span style="color: #95e454;">"""Provide a permanent record DW may access."""</span>
    <span style="color: #cae682;">stem_input_file</span> = os.path.splitext(input_file)[0]
    <span style="color: #cae682;">report_file</span> = <span style="color: #95e454;">""</span>.join([stem_input_file, <span style="color: #e5786d;">str</span>(<span style="color: #95e454;">"_sort.txt"</span>)])

    <span style="color: #8ac6f2; font-weight: bold;">try</span>:
        <span style="color: #8ac6f2; font-weight: bold;">with</span> <span style="color: #e5786d;">open</span>(report_file, encoding=<span style="color: #95e454;">"utf-8"</span>, mode=<span style="color: #95e454;">"w"</span>) <span style="color: #8ac6f2; font-weight: bold;">as</span> newfile:
            newfile.write(<span style="color: #95e454;">""</span>.join([topline, <span style="color: #95e454;">"\n"</span>]))
            <span style="color: #8ac6f2; font-weight: bold;">for</span> entry <span style="color: #8ac6f2; font-weight: bold;">in</span> listing:
                newfile.write(<span style="color: #95e454;">""</span>.join([entry, <span style="color: #95e454;">"\n"</span>]))
    <span style="color: #8ac6f2; font-weight: bold;">except</span> <span style="color: #92a65e; font-weight: bold;">OSError</span>:
        <span style="color: #8ac6f2; font-weight: bold;">print</span>(f<span style="color: #95e454;">"Error to export record into {report_file}.  Exit."</span>)
        sys.<span style="color: #e5786d;">exit</span>()
    <span style="color: #8ac6f2; font-weight: bold;">return</span> report_file


<span style="color: #8ac6f2; font-weight: bold;">def</span> <span style="color: #cae682;">main</span>():
    <span style="color: #95e454;">"""Join the functions."""</span>
    <span style="color: #cae682;">args</span> = get_args()
    <span style="color: #cae682;">input_file</span> = args.source_file
    <span style="color: #cae682;">sort_option</span> = args.reverse  <span style="color: #99968b;"># </span><span style="color: #99968b;">.true. == start by the least popular cluster</span>

    <span style="color: #99968b;"># </span><span style="color: #99968b;">work on old data:</span>
    <span style="color: #8ac6f2; font-weight: bold;">print</span>(<span style="color: #95e454;">"Preview, sort by DataWarrior's cluster labels:"</span>)
    <span style="color: #cae682;">raw_data</span> = access_raw_data(input_file)
    <span style="color: #cae682;">headline</span> = read_header(raw_data)
    <span style="color: #cae682;">popularity</span> = read_dw_list(raw_data)

    <span style="color: #cae682;">sorted_population_list</span> = entry_sorter(popularity, sort_option)
    <span style="color: #cae682;">report_list</span> = scrutin_by_label(raw_data, sorted_population_list)
    <span style="color: #cae682;">report_file</span> = permanent_report(input_file, headline, report_list)

    <span style="color: #99968b;"># </span><span style="color: #99968b;">work on new data:</span>
    <span style="color: #8ac6f2; font-weight: bold;">print</span>(<span style="color: #95e454;">"\nclusters newly sorted and labeled:"</span>)
    <span style="color: #cae682;">raw_data</span> = access_raw_data(report_file)
    <span style="color: #cae682;">headline</span> = read_header(raw_data)
    <span style="color: #cae682;">popularity</span> = read_dw_list(raw_data)


<span style="color: #8ac6f2; font-weight: bold;">if</span> <span style="color: #e5786d;">__name__</span> == <span style="color: #95e454;">"__main__"</span>:
    main()
</pre>
</div>
</div>
</div>

<div id="outline-container-org2409980" class="outline-2">
<h2 id="org2409980"><span class="section-number-2">5.</span> content of the project</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-bash">tree
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">  <span style="color: #e5786d;">.</span>
  &#9500;&#9472;&#9472; datawarrior_clustersort.py
  &#9500;&#9472;&#9472; LICENSE
  &#9500;&#9472;&#9472; README.html
  &#9500;&#9472;&#9472; README.org
  &#9492;&#9472;&#9472; test_data
      &#9500;&#9472;&#9472; 100Random_Molecules.dwar
      &#9500;&#9472;&#9472; 100Random_Molecules_sort.txt
      &#9492;&#9472;&#9472; 100Random_Molecules.txt

  1 directory, 7 files
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Norwid Behrnd</p>
<p class="date">Created: 2022-04-22 Fri 22:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
